#+title: SDL2 backend architecture
#+author: Daniel 'jackdaniel' Kochmański
#+date: [2022-04-12 wto]

* Defining ~plain-sheet~

  To test whether this functionality works, it is necessary to supply a sheet
  to ~realize-mirror~. It is a good occasion to discuss a difference between
  sheets and panes.

  - sheet :: a window that has a region geometry and a coordinate system;
    participates in a parent-child relationship with other sheets, implements
    input and output protocols, and implements the repaint protocol

  - pane :: a sheet tailored for building an application frame. It is a higher
    level abstraction and ports should be ignorant of pane's protocols[fn:1].

  For example "raw" sheets have only default no-op methods on functions
  ~handle-event~ and ~handle-repaint~, while panes have useful methods
  implementing the behavior expected from application frames. The file
  ~plain-sheet~ contains such raw sheet for testing:

  #+begin_src lisp
    (defvar *glider*
      (clim:make-pattern-from-bitmap-file
       (asdf:component-pathname
        (asdf:find-component "clim-examples" '("images" "glider.png")))))

    (defclass plain-sheet (;; repainting
                           clim:immediate-repainting-mixin
                           ;; input
                           clim:immediate-sheet-input-mixin
                           ;; output
                           clim:sheet-mute-output-mixin
                           ;; geometry
                           clim:sheet-identity-transformation-mixin
                           ;; genealogy
                           clim:sheet-parent-mixin
                           clim:sheet-leaf-mixin
                           ;; windowing
                           clime:top-level-sheet-mixin
                           clim:mirrored-sheet-mixin
                           ;; the base class
                           clim:basic-sheet)
      ()
      (:default-initargs :icon *glider*
                         :pretty-name "McCLIM Test Sheet"
                         :region (clim:make-rectangle* 1000 100 1400 500)))
  #+end_src

  #+RESULTS:
  : #<STANDARD-CLASS COMMON-LISP-USER::PLAIN-SHEET>

  Soon we'll define more useful input handlers, but for the time being let's
  make stubs:

  #+begin_src lisp
    (defgeneric handle-sdl2-window-event (event-key sheet timestamp data1 data2)
      (:method (event-key sheet timestamp data1 data2)
        (log:debug "Unhandled window event ~s." event-key)))

    ;; (define-sdl2-handler (ev :windowevent) (event window-id timestamp data1 data2)
    ;;   (alexandria:when-let ((sheet (get-mirror-sheet *sdl2-port* window-id)))
    ;;     (let ((event-key (autowrap:enum-key '(:enum (windowevent.event)) event)))
    ;;       (handle-sdl2-window-event event-key sheet timestamp data1 data2))))

    (defmethod handle-sdl2-window-event ((key (eql :close)) sheet stamp d1 d2)
      (log:info "Destroying a window.")
      (destroy-mirror (port sheet) sheet))

    ;;; Between pressing quit and the actual close the user may still use the
    ;;; window for a brief period, so i.e a window event may sneak in. The window
    ;;; event handler should ignore events to windows that are already destroyed.
    (defmethod handle-sdl2-window-event ((key (eql :exposed)) sheet stamp d1 d2)
      (log:info "Repainting a window.")
      ;; The call to GET-WINDOW-SURFACE is for side the effect, namely to ensure
      ;; that the surface is allocated (to be able to call UPDATE-WINDOW).
      (let ((window (sdl2-window (sheet-mirror sheet))))
        (sdl2:get-window-surface window)
        (sdl2:update-window window)))
  #+end_src

  #+RESULTS:
  : #<STANDARD-METHOD COMMON-LISP-USER::HANDLE-SDL2-WINDOW-EVENT ((EQL :EXPOSED) T
  :                                                               T T T) {100425E213}>

  Now we may fiddle with this sheet:

  #+begin_example
    > (defvar *sheet* (make-instance 'plain-sheet))
    > (realize-mirror (find-port :server-path :sdl2) *sheet*)
    > (setf (sheet-pretty-name *sheet*) "McCLIM Production Sheet")
    > (destroy-mirror (port *sheet*) *sheet*)
  #+end_example

  These instructions should work without changes for all McCLIM ports.

